app/views/posts/new.html.erb

      <br>
      <%= collection_check_boxes(:post, :category_ids, Category.all, :id, :name) do |cbox|%>
---
SELECT "categories".* FROM "categories"